app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "created_at", "updated_at", "author_id", "post_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Hi @Dagi, Your post is really life saver. Thank you."], ["created_at", "2023-02-11 17:47:38.875200"], ["updated_at", "2023-02-11 17:47:38.875200"], ["author_id", 1], ["post_id", 1]]
---
  def create
    post_id = params[:post_id].to_i
    post = Post.find(post_id)
    text = params[:comment][:text]
    @comment = Comment.new(text:, author: current_user, post:)
    if @comment.save