app/controllers/posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 7]]
---
  def index
    @current_user = User.find_by!(id: params[:user_id])
    @posts = Post.where(author_id: @current_user)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 1], ["id", nil], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = $1 AND "posts"."id" = $2 LIMIT $3  [["author_id", 6], ["id", 1], ["LIMIT", 1]]
---
  def show
    @current_user = User.find_by!(id: params[:user_id])
    @posts = Post.where(author_id: @current_user)
    @post = @posts.find(params[:id])

INSERT INTO "posts" ("title", "text", "comments_counter", "likes_counter", "created_at", "updated_at", "author_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    title = params[:post][:title]
    text = params[:post][:text]
    @post = Post.new(title:, text:, comments_counter: 0, likes_counter: 0, author: current_user)
    if @post.save